//   Завдання 4 На рахунку користувача є 23580 кредитів, значення яких зберігається в
//   змінній credits (створи зміну та присвой). Користувач вирішує купити телевізори,
//   які коштують по 3000 кредитів за штуку. Ціна одного телевізора зберігається в
//   змінній pricePerDroid (створи та присвой).
  
//   При відвідуванні сторінки, використовуючи prompt, необхідно запитати кількість
//   телевізорів, які користувач хоче купити і зберегти в змінну.
  
//   Напишіть скрипт, який:
  
//   Якщо в prompt була натиснута кнопка Cancel, виведе повідомлення в консоль
//   «Операцію скасовано!» У протилежному випадку розраховує загальну ціну замовлення
//   та зберігає в змінній totalPrice. Перевіряє, чи зможе користувач оплатити
//   замовлення: якщо сума до оплати перевищує кількість кредитів на рахунок, виводе
//   в консоль повідомлення 'Недостатньо коштів на рахунку!'. в іншому випадку
//   Необхідно підрахувати залишок кредитів на рахунку та вивести повідомлення «Ви
//   купили [кількість] телевізорів, на рахунку залишилось [число] кредитів.'.

// Створення та присвоєння значень змінним
let credits = 23580;
const pricePerDroid = 3000;

// Запит кількості телевізорів від користувача
let userInput = prompt('Скільки телевізорів ви хочете купити?');

// Перевірка, чи користувач натиснув Cancel
if (userInput === null) {
  console.log('Операцію скасовано!');
} else {
  // Розрахунок загальної ціни замовлення
  const numberOfDroids = parseInt(userInput);
  const totalPrice = numberOfDroids * pricePerDroid;

  // Перевірка, чи користувач може оплатити замовлення
  if (totalPrice > credits) {
    console.log('Недостатньо коштів на рахунку!');
  } else {
    // Підрахунок залишку кредитів та виведення повідомлення
    credits -= totalPrice;
    console.log(`Ви купили ${numberOfDroids} телевізорів, на рахунку залишилось ${credits} кредитів.`);
  }
}