// Завдання 6 (завдання із зірочкою, не обовʼязкове до виконання.)
// Напишіть скрипт, який просить відвідувача ввести число в prompt, поки
// відвідувач не натисне Cancel і кожен раз додає введене значення до загальної
// суми.

// При завантаженні сторінки користувачеві пропонується prompt ввести число.
// Введене число додається до значення змінної total. Операція введення числа
// продовжується до тих пір, поки користувач не натисне кнопку Cancel в prompt.
// Після того як користувач припинив введення натиснувши кнопку Cancel, вивести в
// alert «Загальна сума чисел дорівнює [сума]». 🔔 Робити перевірку того, що
// обліковий запис має саме число, а не довільний набір символів, не потрібно. Якщо
// хочеш, у разі некоректного введення, показуй alert з текстом «Було введено не
// число, спробуйте ще раз», при цьому результат prompt плюсувати до загальної суми
// не потрібно, після чого користувачеві пропонується ввести число в запит let
// input; let total = 0;


function sumNumbers() {
    let input
    let total = 0
    while ((input = prompt("Введіть число: ")) !== null) {
      if (!isNaN(input)) {
        total += parseInt(input)
      } else {
        alert("Було введено не число, спробуйте ще раз")
      }
    }
    alert(`Загальна сума чисел дорівнює ${total}`)
  }
  
  sumNumbers()