// Завдання 5

// Користувач може оформити доставку товару до себе в країну, вказавши її при
// відвідуванні сторінки в prompt. Врахуй, користувач може ввести ім'я країни не
// тільки буквами нижнього реєстру, а й на приклад 'кИтАЙ'.

// Напишіть скрипт, який виводить повідомлення про вартість доставки у вказану
// країну. Формат повідомлення: 'Доставка в [країна] буде коштувати [ціна]
// кредитів.

// Якщо зазначеної країни немає в списку, то виводи в alert повідомлення 'В вашій
// країні доставка не доступна'.

// Нижче наведено список країн і вартість доставки.

// Китай - 100 кредитів Чилі - 250 кредитів Австралія - 170 кредитів Індія – 80
// кредитів Ямайка - 120 кредитів


const countries = {
    китай: 100,
    чилі: 250,
    австралія: 170,
    індія: 80,
    ямайка: 120,
  };
  
  // Запит країни
  let country = prompt('Введіть назву країни:');
  
  // Перетворення назви країни в нижній регістр
  country = country.toLowerCase();
  
  // Перевірка наявності країни
  if (countries.hasOwnProperty(country)) {
    // Отримання ціни доставки
    const price = countries[country];
  
    // Виведення повідомлення про вартість
    alert(`Доставка в ${country} буде коштувати ${price} кредитів.`);
  } else {
    // Повідомлення про недоступність доставки
    alert('В вашій країні доставка не доступна.');
  }
  